# Напишите программу, которая принимает на вход цифру, обозначающую день недели,
# и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

# a = int(input('Введите день недели,\n обозначенный соответствующим числом: \n'))
# if a <= 5:
#     print(f' {a} -> будний день')
# elif a > 5 and a <= 7:
#     print(f' {a} -> выходной день')
# else:
#     print(f' {a} -> введен некорректно день')

# Напишите программу для. проверки истинности утверждения
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

# print('x y z')
# for x in range(2):
#     for y in range(2):
#         for z in range(2):
#             if (not(x or y or z)) == (not(x) and not(y) and not(z)):
#                 print(x, y, z)
#                 print (f'¬(X = {x} ⋁ Y = {y} ⋁ Z = {z}) = ¬X = {x} ⋀ ¬Y = {y} ⋀ ¬Z = {z}')
#
# for x in range(2):
#         for y in range(2):
#             for z in range(2):
#                 print(f'x = {x}, y = {y}, z = {z}')
#                 print(not (x or y or z) == (not x and not y and not z))

# Напишите программу, которая принимает на вход координаты точки (X и Y),
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости,
# в которой находится эта точка (или на какой оси она находится).
# Пример:
# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3


# X = int(input('Ввведите координату X '))
# Y = int(input('Ввведите координату Y '))
#
#
# if X == 0 and Y == 0:
#     print('Точка находиться на оси')
# elif X > 0 and Y > 0:
#     print('Точка находиться в первой четверти')
# elif X < 0 and Y < 0:
#     print('Точка находиться в третьей четверти')
# elif X > 0 and Y < 0:
#     print('Точка находиться во второй четверти')
# else:
#     print('Точка находиться в четверотой четверти')


# Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y).

# Console.WriteLine("Ввведите номер четверти:");
# int field = Convert.ToInt32(Console.ReadLine());
# while (field>4 || field<1)
# {
#     Console.WriteLine("Ввведите номер четверти(это число от 1 до 4): ");
#     field = Convert.ToInt32(Console.ReadLine());
# }
# if (field == 1)
# {
#     Console.WriteLine("Точка находиться в первой четверти: x > 0 и y > 0 ");
# }
# else if (field == 2)
# {
#     Console.WriteLine("Точка находиться во второй четверти: x < 0 и y > 0 ");
# }
# else if (field == 3)
# {
#     Console.WriteLine("Точка находиться в третьей четверти: x < 0 и y < 0 ");
# }
# else
# {
#     Console.WriteLine("Точка находиться в четвертой четверти: x > 0 и y < 0 ");
# }


# field = int(input('Ввведите номер четверти: это число от 1 до 4 '))
# if field == 1:
#     print('Точка находиться в первой четверти: x > 0 и y > 0')
# elif field == 2:
#     print('Точка находиться во второй четверти: x < 0 и y > 0')
# elif field == 3:
#     print('Точка находиться в третьей четверти: x < 0 и y < 0')
# else:
#     print('Точка находиться в четвертой четверти: x > 0 и y < 0')



# Напишите программу, которая принимает на вход координаты двух точек
# и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21


xA = int(input('Ввведите координату xA: '))
yA = int(input('Ввведите координату yA: '))
xB = int(input('Ввведите координату xB: '))
yB = int(input('Ввведите координату yB: '))


AB_distance = ((xB-xA)**2 + (yB-yA)**2)**0.5
# print('{:.2f}'.format(AB_distance))
print(f'A ({xA}, {xB}); B ({yA}, {yB}) -> {AB_distance}')
