# a = 'www'
# print(type(a))
# a = 51      # None - ничего
# print(type(a))
# and or not /  и или нет

# 1. Напишите программу, которая принимает на вход два числа и
#   проверяет, является ли одно число квадратом другого.
# - 5, 25 -> да
# - 4, 16 -> да
# - 25, 5 -> да
# - 8, 9 -> нет
print('Введите a: ')
a = int(input('a = '))
print('Введите b: ')
b = int(input('b = '))
sqrt = a*a
if sqrt == b and sqrt == a:
    print('a, b -> yes')
else:
    print('a, b -> no')


# 2. Напишите программу, которая на вход принимает 5 чисел
#   и находит максимальное из них.
# - 1, 4, 8, 7, 5 -> 8
# - 78, 55, 36, 90, 2 -> 90'''
